results/out/aleph.ring-interceptors.async.java17.ZGC.r30k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 2.120ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.147ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.099ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.094ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.086ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.097ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.125ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.046ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.085ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.137ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.141ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.118ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.052ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.083ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.094ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.082ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.05ms    4.41ms  81.60ms   94.07%
    Req/Sec     1.98k   399.88     9.00k    79.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.04ms
 75.000%    1.44ms
 90.000%    2.09ms
 99.000%   25.61ms
 99.900%   38.75ms
 99.990%   50.88ms
 99.999%   65.47ms
100.000%   81.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.075     0.000000            3         1.00
       0.424     0.100000      1778203         1.11
       0.606     0.200000      3541261         1.25
       0.764     0.300000      5318180         1.43
       0.906     0.400000      7078918         1.67
       1.043     0.500000      8848728         2.00
       1.112     0.550000      9742891         2.22
       1.182     0.600000     10624508         2.50
       1.257     0.650000     11504672         2.86
       1.340     0.700000     12391289         3.33
       1.437     0.750000     13274968         4.00
       1.494     0.775000     13716578         4.44
       1.560     0.800000     14157607         5.00
       1.639     0.825000     14601244         5.71
       1.737     0.850000     15043467         6.67
       1.868     0.875000     15485622         8.00
       1.960     0.887500     15706700         8.89
       2.091     0.900000     15926665        10.00
       2.331     0.912500     16148888        11.43
       3.083     0.925000     16369076        13.33
       5.687     0.937500     16590244        16.00
       7.199     0.943750     16700972        17.78
       8.895     0.950000     16811756        20.00
      10.743     0.956250     16922110        22.86
      12.775     0.962500     17032825        26.67
      15.063     0.968750     17143491        32.00
      16.279     0.971875     17198577        35.56
      17.583     0.975000     17254171        40.00
      18.959     0.978125     17309144        45.71
      20.447     0.981250     17364573        53.33
      22.063     0.984375     17419732        64.00
      22.959     0.985938     17447378        71.11
      23.919     0.987500     17475204        80.00
      24.943     0.989062     17502946        91.43
      26.079     0.990625     17530473       106.67
      27.359     0.992188     17557990       128.00
      28.079     0.992969     17571970       142.22
      28.863     0.993750     17585811       160.00
      29.695     0.994531     17599504       182.86
      30.623     0.995313     17613209       213.33
      31.679     0.996094     17627093       256.00
      32.271     0.996484     17633975       284.44
      32.927     0.996875     17640885       320.00
      33.663     0.997266     17647887       365.71
      34.495     0.997656     17654848       426.67
      35.423     0.998047     17661726       512.00
      35.967     0.998242     17665236       568.89
      36.543     0.998437     17668650       640.00
      37.183     0.998633     17671997       731.43
      37.951     0.998828     17675467       853.33
      38.847     0.999023     17678907      1024.00
      39.391     0.999121     17680699      1137.78
      39.967     0.999219     17682402      1280.00
      40.639     0.999316     17684099      1462.86
      41.439     0.999414     17685848      1706.67
      42.335     0.999512     17687527      2048.00
      42.879     0.999561     17688395      2275.56
      43.519     0.999609     17689252      2560.00
      44.255     0.999658     17690118      2925.71
      45.119     0.999707     17691004      3413.33
      46.111     0.999756     17691836      4096.00
      46.751     0.999780     17692279      4551.11
      47.423     0.999805     17692711      5120.00
      48.127     0.999829     17693144      5851.43
      48.895     0.999854     17693570      6826.67
      49.855     0.999878     17694004      8192.00
      50.399     0.999890     17694211      9102.22
      51.007     0.999902     17694434     10240.00
      51.775     0.999915     17694648     11702.86
      52.543     0.999927     17694860     13653.33
      53.695     0.999939     17695076     16384.00
      54.495     0.999945     17695184     18204.44
      55.487     0.999951     17695293     20480.00
      56.479     0.999957     17695401     23405.71
      57.471     0.999963     17695508     27306.67
      58.719     0.999969     17695615     32768.00
      59.423     0.999973     17695676     36408.89
      59.999     0.999976     17695724     40960.00
      61.055     0.999979     17695779     46811.43
      61.951     0.999982     17695832     54613.33
      62.815     0.999985     17695887     65536.00
      63.455     0.999986     17695912     72817.78
      64.415     0.999988     17695939     81920.00
      65.183     0.999989     17695968     93622.86
      65.983     0.999991     17695997    109226.67
      66.687     0.999992     17696020    131072.00
      67.135     0.999993     17696034    145635.56
      67.775     0.999994     17696047    163840.00
      68.287     0.999995     17696062    187245.71
      68.735     0.999995     17696074    218453.33
      69.567     0.999996     17696088    262144.00
      70.207     0.999997     17696097    291271.11
      70.591     0.999997     17696102    327680.00
      71.167     0.999997     17696108    374491.43
      71.871     0.999998     17696115    436906.67
      72.895     0.999998     17696122    524288.00
      73.535     0.999998     17696126    582542.22
      73.791     0.999998     17696129    655360.00
      73.983     0.999999     17696132    748982.86
      74.239     0.999999     17696135    873813.33
      75.519     0.999999     17696139   1048576.00
      75.647     0.999999     17696140   1165084.44
      76.351     0.999999     17696142   1310720.00
      76.671     0.999999     17696144   1497965.71
      76.991     0.999999     17696145   1747626.67
      77.439     1.000000     17696147   2097152.00
      78.079     1.000000     17696148   2330168.89
      78.463     1.000000     17696149   2621440.00
      79.039     1.000000     17696151   2995931.43
      79.039     1.000000     17696151   3495253.33
      79.039     1.000000     17696151   4194304.00
      79.679     1.000000     17696152   4660337.78
      79.679     1.000000     17696152   5242880.00
      79.871     1.000000     17696153   5991862.86
      79.871     1.000000     17696153   6990506.67
      79.871     1.000000     17696153   8388608.00
      80.447     1.000000     17696154   9320675.55
      80.447     1.000000     17696154  10485760.00
      80.447     1.000000     17696154  11983725.71
      80.447     1.000000     17696154  13981013.34
      80.447     1.000000     17696154  16777216.00
      81.663     1.000000     17696155  18641351.10
      81.663     1.000000     17696155          inf
#[Mean    =        2.052, StdDeviation   =        4.406]
#[Max     =       81.600, Total count    =     17696155]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17998218 requests in 10.00m, 3.00GB read
Requests/sec:  29997.05
Transfer/sec:      5.12MB